---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHookOrientation.Right
enum: Autodesk.Revit.DB.Structure.RebarHookOrientation
source: html/e8365754-0811-8d4e-864a-55bf34af3a87.htm
---
# Autodesk.Revit.DB.Structure.RebarHookOrientation.Right

Hook towards the right of a segment-based shape (RebarShapeDefinitionBySegments), or to the
 exterior of an arc-based shape (RebarShapeDefinitionByArc).